# All Credits Belong to CipherX and Future Technology Channel 
# Join our channel ~ @FutureTechnologyGuardX
# Copy with Credit 

import asyncio
from telethon import TelegramClient, events, utils, functions, types, connection

print("""   _______       __             _  __
  / ____(_)___  / /_  ___  ____| |/ /
 / /   / / __ \/ __ \/ _ \/ ___/   /
/ /___/ / /_/ / / / /  __/ /  /   |
\____/_/ .___/_/ /_/\___/_/  /_/|_|
      /_/
""") 

api_id = int(input('Enter your account api_id <Get from my.telegram.org>: '))
api_hash = input('Enter your account api_hash <Get from my.telegram.org>: ')
cipherx = TelegramClient("CɪᴘʜᴇʀX", api_id , api_hash )
cipherx.start() 

@cipherx.on(events.NewMessage(pattern="^.type (.*)"))
async def typewriter(event):
    if event.fwd_from:
        return
    input_str = event.pattern_match.group(1)
    cipherxbot = "\u2060"
    for i in range(601):
        cipherxbot += "\u2060"
    try:
        await event.edit(cipherxbot)
    except Exception as e:
        logger.warn(str(e))
    typing_symbol = "|"
    delay = 0.03
    previous_text = ""
    await event.edit(typing_symbol)
    await asyncio.sleep(delay)
    for character in input_str:
        previous_text = previous_text + "" + character
        typing_text = previous_text + "" + typing_symbol
        try:
            await event.edit(typing_text)
        except Exception as e:
            logger.warn(str(e))
        await asyncio.sleep(delay)
        try:
            await event.edit(previous_text)
        except Exception as e:
            logger.warn(str(e))
        await asyncio.sleep(delay)
        
@cipherx.on(events.NewMessage(pattern=r"norouz"))
async def norouz(event):
    if event.fwd_from:
        return
        await event.edit("💜💜                           💜💜\n💜💜💜                       💜💜\n💜💜💜💜                 💜💜\n💜💜  💜💜               💜💜\n💜💜     💜💜            💜💜\n💜💜         💜💜        💜💜\n💜💜             💜💜    💜💜\n💜💜                 💜💜💜💜\n💜💜                     💜💜💜\n💜💜                          💜💜")
⁭        await asyncio.sleep(0.5)
        await event.edit("          💖💖💖💖💖\n     💖💖💖💖💖💖💖\n   💖💖                   💖💖\n 💖💖                       💖💖\n💖💖                         💖💖\n💖💖                         💖💖\n 💖💖                       💖💖\n   💖💖                   💖💖\n      💖💖💖💖💖💖💖\n            💖💖💖💖💖")
⁭        await asyncio.sleep(0.5)
        await event.edit("💙💙💙💙💙💙💙\n💙💙💙💙💙💙💙💙\n💙💙                     💙💙\n💙💙                     💙💙\n💙💙💙💙💙💙💙💙\n💙💙💙💙💙💙💙\n💙💙    💙💙\n💙💙         💙💙\n💙💙              💙💙\n💙💙                  💙💙")
⁭        await asyncio.sleep(0.5)
        await event.edit("          💖💖💖💖💖\n     💖💖💖💖💖💖💖\n   💖💖                   💖💖\n 💖💖                       💖💖\n💖💖                         💖💖\n💖💖                         💖💖\n 💖💖                       💖💖\n   💖💖                   💖💖\n      💖💖💖💖💖💖💖\n            💖💖💖💖💖")
⁭        await asyncio.sleep(0.5)
        await event.edit("💜💜                      💜💜\n💜💜                      💜💜\n💜💜                      💜💜\n💜💜                      💜💜\n💜💜                      💜💜\n💜💜                      💜💜\n💜💜                      💜💜\n  💜💜                  💜💜\n      💜💜💜💜💜💜\n            💜💜💜💜")
⁭        await asyncio.sleep(0.5)
        await event.edit(" 💟💟💟💟💟💟💟\n 💟💟💟💟💟💟💟\n                       💟💟\n                   💟💟\n               💟💟\n           💟💟\n       💟💟\n   💟💟\n💟💟💟💟💟💟💟\n💟💟💟💟💟💟💟")
        await asyncio.sleep(0.5)
        await event.edit("💚💚                              💚💚\n💚💚💚                      💚💚💚\n💚💚💚💚            💚💚💚💚\n💚💚    💚💚    💚💚    💚💚\n💚💚        💚💚💚        💚💚\n💚💚             💚             💚💚\n💚💚                              💚💚\n💚💚                              💚💚\n💚💚                              💚💚\n💚💚                              💚💚")
⁭        await asyncio.sleep(0.5)
        await event.edit("          💖💖💖💖💖\n     💖💖💖💖💖💖💖\n   💖💖                   💖💖\n 💖💖                       💖💖\n💖💖                         💖💖\n💖💖                         💖💖\n 💖💖                       💖💖\n   💖💖                   💖💖\n      💖💖💖💖💖💖💖\n            💖💖💖💖💖")
⁭        await asyncio.sleep(0.5)
        await event.edit("💗💗💗💗💗💗💗\n💗💗💗💗💗💗💗💗\n💗💗                     💗💗\n💗💗                     💗💗\n💗💗💗💗💗💗💗💗\n💗💗💗💗💗💗💗💗\n💗💗                     💗💗\n💗💗                     💗💗\n💗💗💗💗💗💗💗💗\n💗💗💗💗💗💗💗")
        await asyncio.sleep(0.5)
        await event.edit("                    💖\n                  💖💖\n               💖💖💖\n            💖💖 💖💖\n          💖💖    💖💖\n        💖💖       💖💖\n      💖💖💖💖💖💖\n     💖💖💖💖💖💖💖\n   💖💖                 💖💖\n  💖💖                    💖💖\n💖💖                       💖💖")
⁭        await asyncio.sleep(0.5)
        await event.edit("💙💙💙💙💙💙💙\n💙💙💙💙💙💙💙💙\n💙💙                     💙💙\n💙💙                     💙💙\n💙💙💙💙💙💙💙💙\n💙💙💙💙💙💙💙\n💙💙    💙💙\n💙💙         💙💙\n💙💙              💙💙\n💙💙                  💙💙")
⁭        await asyncio.sleep(0.5)
        await event.edit("                   💖\n                  💖💖\n               💖💖💖\n            💖💖 💖💖\n          💖💖    💖💖\n        💖💖       💖💖\n      💖💖💖💖💖💖\n     💖💖💖💖💖💖💖\n   💖💖                 💖💖\n  💖💖                    💖💖\n💖💖                       💖💖")
⁭        await asyncio.sleep(0.5)
        await event.edit("💙💙                  💙💙\n💙💙             💙💙\n💙💙        💙💙\n💙💙   💙💙\n💙💙💙💙\n💙💙 💙💙\n💙💙     💙💙\n💙💙         💙💙\n💙💙              💙💙\n💙💙                   💙💙")
        await asyncio.sleep(0.5)
        await event.edit("Ⲏ")
        await event.edit("Ⲏⲁ")
        await event.edit("Ⲏⲁⲣ")
        await event.edit("Ⲏⲁⲣⲣ")
        await event.edit("Ⲏⲁⲣⲣⲩ")
        await event.edit("Ⲏⲁⲣⲣⲩ ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇ")
        await event.edit("Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ")
        await event.edit("💛💛Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ💛💛")
        await event.edit("💝💝Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ💝💝")
        await event.edit("💓💓Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ💓💓")
        await event.edit("💗💗Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ💗💗")
        await event.edit("💞💞Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ💞💞")
        await event.edit("💖💖Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ💖💖")
        await event.edit("💙💙Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ💙💙")
        await event.edit("💘💘Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ💘💘")
        await event.edit("💕💕Ⲏⲁⲣⲣⲩ Ⲛⲟʀⲟυⲍ ⲧⲟ Ⲉⳳⲉʀⲩⲃⲟⲇⲩ💕💕")



get_event_loop().run_forever()        
cipherx.run_until_disconeccted() 
